import { IFAQItem } from '@/types/faq'

export const faqDatabotApp: IFAQItem[] = [
    {
        id: 1,
        question: 'Для чего нужна разработка ботов и Mini Apps?',
        answer: 'Разработка ботов предоставляет бизнесу новые возможности для взаимодействия с клиентами, автоматизации процессов и расширения охвата аудитории. Боты автоматизируют рутинные задачи и предоставляют базовые функции, в то время как Mini Apps предлагают более сложные интерфейсы и функциональность, сравнимую с полноценными веб-приложениями',
    },
    {
        id: 2,
        question: 'Сколько времени занимает разработка  бота?',
        answer: 'Сроки разработки зависят от: Сложности функционала. Количества интеграций. Дизайна интерфейса. Тестирования. Простой бот можно создать за 1 неделю',
    },
    {
        id: 3,
        question: 'Какова стоимость разработки бота ?',
        answer: 'Стоимость разработки бота начинается от 30 000 рублей. Для получения точного расчёта стоимости свяжитесь с нами',
    },
]
