import { FAQItem } from '@/types/faq'

export const faqDataintegration: FAQItem[] = [
    {
        id: 1,
        question: 'Какие этапы включает в себя интеграция?',
        answer: 'Разработка интеграций сайта может включать в себя следующие этапы: 1.Определение требований к интеграции. На этом этапе определяются цели и задачи интеграции, а также требования к функциональности и производительности. 2. Проектирование системы интеграции. На этом этапе разрабатывается архитектура системы интеграции, определяются протоколы взаимодействия между системами, а также планируются маршруты данных. 3. Разработка кода. На этом этапе создаются модули и компоненты системы интеграции, которые будут взаимодействовать с другими системами. 4. Тестирование системы. На этом этапе проводится тестирование системы интеграции на соответствие требованиям и исправление выявленных ошибок. 5. Внедрение системы. На этом этапе производится настройка и запуск системы интеграции на сервере и на клиентах. 6. Поддержка и обновление системы. На этом этапе осуществляется поддержка и обновление системы интеграции для обеспечения ее работоспособности и соответствия изменяющимся требованиям.',
    },
    {
        id: 2,
        question: 'Сколько времени занимает услуга интеграции?',
        answer: 'Время, необходимое для интеграции сайта с другими системами, варьируется в зависимости от сложности системы. Минимальные сроки разработки составляют 2 недели.',
    },
    {
        id: 3,
        question: 'Какова стоимость услуги по интеграции?',
        answer: 'Стоимость услуги по интеграции начинается от 50 000 рублей. Для получения точного расчёта стоимости свяжитесь с нами',
    },
]
