import { IFAQItem } from '@/types/faq'

export const faqData: IFAQItem[] = [
    {
        id: 1,
        question: 'Почему важно создавать качественный сайт?',
        answer: 'Качественный веб-сайт, обладающий интуитивно понятным интерфейсом и оптимизированный для быстрой загрузки, является ключевым элементом маркетинговой стратегии компании. Он не только способствует увеличению конверсии и росту продаж, но и формирует положительное восприятие бренда, повышая его конкурентоспособность на рынке.',
    },
    {
        id: 2,
        question: 'Для чего нужно профессиональное сопровождение?',
        answer: 'Доверив разработку веб-ресурса опытным специалистам, вы получаете гарантию того, что итоговый продукт будет полностью соответствовать потребностям вашего бизнеса, учитывая все современные тенденции и требования индустрии. Профессиональные разработчики учитывают все детали, что позволяет создать удобный сайт высокого качества и способствует достижению стратегических целей компании.',
    },
    {
        id: 3,
        question: 'Почему за созданием сайта стоит обратиться именно к нам?',
        answer: 'Мы предлагаем высокий уровень качества работ по разработке и продвижению сайтов. Наша команда состоит из опытных разработчиков, дизайнеров, менеджеров и программистов. Мы знаем, как создать сайт, который будет соответствовать вашим потребностям и целям.',
    },
    {
        id: 4,
        question: 'Что представляет собой разработка сайта?',
        answer: 'Разработка сайта - это комплексный подход, который подразумевает его изготовление «под ключ» . Это услуга, которая позволит осуществить развитие бизнеса, создать и расширить целевую аудиторию, сделать более удобным и быстрым взаимодействие с пользователями (клиентами, соискателями вакансий, партнёрами). Разработка сайта упростит вам процесс продвижения вашего бизнеса.',
    },
    {
        id: 5,
        question: 'Как можно заказать создание сайта?',
        answer: 'Вы можете написать нам через форму обратной связи и в свободной форме описать ваши требования и пожелания. Мы свяжемся с вами, уточним детали и предложим решение.',
    },
    {
        id: 6,
        question: 'Какова стоимость и сроки создания сайта?',
        answer: 'Базовая стоимость разработки сайта начинается от 50 000 рублей. Минимальные сроки разработки составляют 2 недели. Для получения точного расчёта стоимости и сроков свяжитесь с нами.',
    },
]
