import { IFAQItem } from '@/types/faq'

export const faqDataback: IFAQItem[] = [
    {
        id: 1,
        question: 'Кому может понадобиться backend?',
        answer: 'Услуги по разработке необходимы компаниям, взаимодействие с потребителями у которых происходит через приложение или веб-ресурс. Как правило, это весь современный бизнес, ведь цифровая трансформация в несколько раз повышает конкурентоспособность предприятия. Сюда можно причислить маркетплейсты, сайты компаний, интернет-магазины и многие другие отрасли. Разработчик поможет вам решить многие вопросы, связанные с созданием и дальнейшим сопровождением проекта.',
    },
    {
        id: 2,
        question: 'Чем отличается backend от frontend?',
        answer: 'Frontend и backend - это две разные, но взаимосвязанные части веб-разработки. Frontend занимается созданием пользовательского интерфейса веб-сайтов и приложений, а backend — серверной части и обработкой данных.',
    },
    {
        id: 3,
        question: 'Сколько времени требуется на бэкенд-разработку?',
        answer: 'Продолжительность реализации проекта определяется целым комплексом условий: технической сложностью разработки, численностью backend-специалистов в команде и спецификой применяемых технологических решений. В среднем процесс разработки варьируется от нескольких недель до нескольких месяцев.Наша команда специализируется на решении нестандартных задач повышенной сложности. Мы гордимся своим профессиональным опытом и готовы применить его в вашем проекте. Свяжитесь с нами для детального обсуждения ваших идей и запросов.',
    },
]
