import { FAQItem } from '@/types/faq'

export const faqDatafront: FAQItem[] = [
    {
        id: 1,
        question: 'Кому может понадобиться frontend?',
        answer: 'Frontend-разработка нужна для создания пользовательского интерфейса веб-сайтов и приложений, то есть той части, с которой взаимодействует пользователь. Она делает сайты удобными, красивыми и функциональными, обеспечивая корректное отображение на разных устройствах и в разных браузерах.',
    },
    {
        id: 2,
        question: 'Чем отличается backend от frontend?',
        answer: 'Frontend и backend - это две разные, но взаимосвязанные части веб-разработки. Frontend занимается созданием пользовательского интерфейса веб-сайтов и приложений, а backend — серверной части и обработкой данных',
    },
    {
        id: 3,
        question: 'Сколько времени требуется на frontend-разработку?',
        answer: 'Сроки фронтенд-разработки формируются индивидуально для каждого проекта и зависят от его сложности, функционала и технических требований.Свяжитесь с нами для детального обсуждения ваших идей и запросов.',
    },
]
