import { FAQItem } from '@/types/faq'

export const faqDataintegration: FAQItem[] = [
    {
        id: 1,
        question: 'Какие этапы включает в себя интеграция?',
        answer: 'Качественный веб-сайт, обладающий интуитивно понятным интерфейсом и оптимизированный для быстрой загрузки, является ключевым элементом маркетинговой стратегии компании. Он не только способствует увеличению конверсии и росту продаж, но и формирует положительное восприятие бренда, повышая его конкурентоспособность на рынке.',
    },
    {
        id: 2,
        question: 'Сколько времени занимает услуга интеграции?',
        answer: 'Доверив разработку веб-ресурса опытным специалистам, вы получаете гарантию того, что итоговый продукт будет полностью соответствовать потребностям вашего бизнеса, учитывая все современные тенденции и требования индустрии. Профессиональные разработчики учитывают все детали, что позволяет создать удобный сайт высокого качества и способствует достижению стратегических целей компании.',
    },
    {
        id: 3,
        question: 'Какова стоимость услуги по интеграции?',
        answer: 'Мы предлагаем высокий уровень качества работ по разработке и продвижению сайтов. Наша команда состоит из опытных разработчиков, дизайнеров, менеджеров и программистов. Мы знаем, как создать сайт, который будет соответствовать вашим потребностям и целям.',
    },
]
