import { Project } from '@/types/projects'

export const projects: Project[] = [
    {
        id: 1,
        title: 'Ризолют',
        description: 'Создание сайта и системы расчета',
        category: 'site-dev',
        image: '/img/project-kitchen.png',

        tasks: [
            'Основная задача проекта заключалась в комплексном продвижении бренда и повышении его узнаваемости на рынке. Важным аспектом являлось не только привлечение новых клиентов, но и удержание существующих. Для достижения этой цели было принято решение о создании удобной и функциональной системы бронирования, которая бы упростила взаимодействие клиентов с компанией и повысила их лояльность.',
        ],
        solutions: [
            'Для реализации поставленной задачи был разработан веб-сайт с использованием современных технологий.  Frontend часть сайта, отвечающая за пользовательский интерфейс и взаимодействие, была реализована на JavaScript с применением библиотеки React.  React позволил создать динамичные и отзывчивые страницы, обеспечивающие удобство навигации и использования. Backend часть сайта, отвечающая за обработку данных, логику приложения и взаимодействие с базой данных, была разработана на Python с использованием фреймворка Django. Django предоставил мощный и гибкий инструментарий для быстрого и эффективного создания серверной части приложения.Для обеспечения безопасности и управления доступом пользователей была реализована система аутентификации на основе JWT (JSON Web Tokens).  JWT позволяет безопасно передавать информацию о пользователе между клиентом и сервером, обеспечивая надежную защиту данных.',
        ],
        results: [
            'В результате реализации проекта была создана современная и функциональная система бронирования, способствующая увеличению узнаваемости бренда и привлечению новых клиентов. Удобный и интуитивно понятный интерфейс, разработанный на React, обеспечивает положительный пользовательский опыт. Надежная и масштабируемая backend часть, реализованная на Django, гарантирует стабильную работу системы и возможность ее дальнейшего развития. Система аутентификации на основе JWT обеспечивает безопасность данных пользователей и защиту от несанкционированного доступа. В целом, проект успешно решает поставленные задачи и способствует укреплению позиций бренда на рынке.',
        ],
    },
    {
        id: 2,
        title: 'Телеграм-бот',
        description: 'Управление подписчиками и рассылками',
        category: 'bot-dev',
        image: '/img/telegrambot.png',
        tasks: [
            'Разработать современный дизайн',
            'Обеспечить высокую скорость загрузки',
            'Реализовать адаптивную верстку',
        ],
        solutions: [
            'Использовали React и Next.js для разработки',
            'Применили оптимизацию изображений и кэширование',
            'Использовали CSS Grid и Flexbox для адаптивности',
        ],
        results: [
            'Увеличили конверсию на 30%',
            'Снизили время загрузки на 50%',
            'Получили положительные отзывы от клиентов',
        ],
    },
    {
        id: 3,
        title: 'Runkaline',
        description: 'Создай приложение для продвижения',
        category: 'app-dev',
        image: '/img/project-runkaline.png',
        tasks: [
            'Разработать современный дизайн',
            'Обеспечить высокую скорость загрузки',
            'Реализовать адаптивную верстку',
        ],
        solutions: [
            'Использовали React и Next.js для разработки',
            'Применили оптимизацию изображений и кэширование',
            'Использовали CSS Grid и Flexbox для адаптивности',
        ],
        results: [
            'Увеличили конверсию на 30%',
            'Снизили время загрузки на 50%',
            'Получили положительные отзывы от клиентов',
        ],
    },
    {
        id: 4,
        title: 'Прием',
        description: 'Разработка системы доставки',
        category: 'app-dev',
        image: '/img/project-food.png',
        tasks: [
            'Разработать современный дизайн',
            'Обеспечить высокую скорость загрузки',
            'Реализовать адаптивную верстку',
        ],
        solutions: [
            'Использовали React и Next.js для разработки',
            'Применили оптимизацию изображений и кэширование',
            'Использовали CSS Grid и Flexbox для адаптивности',
        ],
        results: [
            'Увеличили конверсию на 30%',
            'Снизили время загрузки на 50%',
            'Получили положительные отзывы от клиентов',
        ],
    },
    {
        id: 5,
        title: 'Mandarina',
        description: 'Разработка системы бронирования',
        category: 'app-dev',
        image: '/img/project-mandarina.png',

        tasks: [
            'Разработать современный дизайн',
            'Обеспечить высокую скорость загрузки',
            'Реализовать адаптивную верстку',
        ],
        solutions: [
            'Использовали React и Next.js для разработки',
            'Применили оптимизацию изображений и кэширование',
            'Использовали CSS Grid и Flexbox для адаптивности',
        ],
        results: [
            'Увеличили конверсию на 30%',
            'Снизили время загрузки на 50%',
            'Получили положительные отзывы от клиентов',
        ],
    },

    {
        id: 6,
        title: 'Мария-Медицина',
        description: 'AI-ассистент для помощи врачам и пациентам',
        category: 'tech-projects',
        image: '/img/mariymediz.png',
        tasks: [
            'Разработать современный дизайн',
            'Обеспечить высокую скорость загрузки',
            'Реализовать адаптивную верстку',
        ],
        solutions: [
            'Использовали React и Next.js для разработки',
            'Применили оптимизацию изображений и кэширование',
            'Использовали CSS Grid и Flexbox для адаптивности',
        ],
        results: [
            'Увеличили конверсию на 30%',
            'Снизили время загрузки на 50%',
            'Получили положительные отзывы от клиентов',
        ],
    },
    {
        id: 7,
        title: 'Мария-Медицина',
        description: 'AI-ассистент для помощи врачам и пациентам',
        category: 'tech-projects',
        image: '/img/mariymediz.png',
        tasks: [
            'Разработать современный дизайн',
            'Обеспечить высокую скорость загрузки',
            'Реализовать адаптивную верстку',
        ],
        solutions: [
            'Использовали React и Next.js для разработки',
            'Применили оптимизацию изображений и кэширование',
            'Использовали CSS Grid и Flexbox для адаптивности',
        ],
        results: [
            'Увеличили конверсию на 30%',
            'Снизили время загрузки на 50%',
            'Получили положительные отзывы от клиентов',
        ],
    },
]
