import { FAQItem } from '@/types/faq'

export const faqData: FAQItem[] = [
    {
        id: 1,
        question:
            'Зачем обращаться за разработкой программного обеспечения к профессионалам?',
        answer: 'Обращайтесь за разработкой программного обеспечения к профессионалам Разработка, модернизация и поддержка программного обеспечения — это трудоемкий процесс, требующий постоянного анализа рыночных тенденций и оперативного внедрения инновационных решений. Важно регулярно обновлять и проверять функциональность ПО, а также отслеживать реакцию пользователей на внесенные изменения.',
    },
    {
        id: 2,
        question: 'Какая стоимость услуги разработки программного обеспечения?',
        answer: 'Стоимость разработки программного обеспечения зависит от множества факторов. Сложность проекта, требования к качеству, команда, сроки выполнения, используемые технологии и многое другое. Вы также можете запросить бесплатную консультацию, на которой мы детально обсудим все параметры и предоставим предварительный расчет стоимости.',
    },
    {
        id: 3,
        question:
            'Почему вам стоит обратиться за разработкой ПО в студию Entergen?',
        answer: 'Поддержка разработки ПО от студии Entergen - это:• Работа над проектом высококвалифицированных специалистов, которые постоянно совершенствуют свои навыки;• Индивидуальный подход к каждому проекту с учетом уникальных потребностей бизнеса;• Постоянное сопровождение проектов без перерывов на отпуска, больничные и другие непредвиденные обстоятельства;• Конкурентноспособные цены за высококачественные услуги.',
    },
]
