import { IFAQItem } from '@/types/faq'

export const faqDataAlcreation: IFAQItem[] = [
    {
        id: 1,
        question: 'Что такое ИИ и как он работает?',
        answer: ' Искусственный интеллект — компьютерная программа, внедренная в бизнес-процессы и призванная автоматизировать рутинные задачи. В основе ее работы лежит машинное обучение, позволяющее ИИ учиться, запоминать, анализировать и прогнозировать события с учетом полученной информации. Алгоритмы обучаются на основе данных, чтобы выполнять определенные задачи без необходимости жесткого программирования',
    },
    {
        id: 2,
        question: 'Зачем бизнесу внедрять искусственный интеллект?',
        answer: ' Бизнесу выгодно внедрять искусственный интеллект (ИИ) для повышения эффективности и производительности за счёт автоматизации рутинных процессов, снижения затрат на персонал и операции, а также для получения точных прогнозов и выявления скрытых закономерностей в больших объёмах данных. Кроме того, ИИ помогает улучшить качество обслуживания клиентов через персонализированные предложения и быструю поддержку, что способствует росту лояльности, и обеспечивает гибкость и масштабируемость бизнеса, давая ему конкурентное преимущество на рынке',
    },
    {
        id: 3,
        question: 'В каких сферах можно применить ИИ?',
        answer: ' Наши ИИ-решения успешно работают в:Розничной торговле и e-commerce Производственных компаниях Финансовом секторе Гостиничном бизнесе Медицинских учреждениях Образовательных проектах ',
    },
]
