import { IFAQItem } from '@/types/faq'

export const faqDatasystems: IFAQItem[] = [
    {
        id: 1,
        question: 'Что такое ИT-архитектура для бизнеса?',
        answer: 'ИT-архитектура компании — это совокупность взаимосвязанных технологических и технических (программно-аппаратных) решений и компонентов, обеспечивающих эффективное функционирование бизнеса.Проще говоря, это концепция, описывающая взаимосвязь между элементами системы — программами, приложениями и базами данных. Графически архитектуру можно представить как многоуровневую систему, где элементы взаимодействуют между собой',
    },
    {
        id: 2,
        question:
            'Для чего нужно проектирование IT-архитектуры программного обеспечения?',
        answer: 'Проектирование IT-архитектуры программного обеспечения проводится для создания надежной, масштабируемой и управляемой системы, которая соответствует бизнес-целям, облегчает разработку и поддержку, минимизирует риски и затраты, а также позволяет бизнесу эффективно развиваться и адаптироваться к изменениям. Архитектура определяет структуру системы, компоненты, их взаимодействие и взаимодействие с внешними системами, обеспечивая при этом достижение целей по производительности, безопасности и доступности',
    },
    {
        id: 3,
        question:
            'Сколько времени требуется на проектирование IT-архитектуры ПО?',
        answer: 'Время на проектирование IT-архитектуры программного обеспечения варьируется от нескольких недель до нескольких месяцев, так как зависит от сложности проекта, его масштаба, выбранной методологии и объема необходимой документации.Свяжитесь с нами для детального обсуждения ваших идей и запросов.',
    },
]
